// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
Console.WriteLine("введите первое число:");
int n1 = int.Parse(Console.ReadLine());
Console.WriteLine("введите второе число:");
int n2 = int.Parse(Console.ReadLine());
Console.WriteLine("введите третье число:");
int n3 = int.Parse(Console.ReadLine());

if (n1 > n2)
{
 max = n1;
}

s max = n2;

Console.Write("максимальное число");
Console.WriteLine(max);